#include "cpu_reg.h"
#include "common.h"

void zhiling();

void main()					//主函数
{
	init_dsp(); 			//dsp初始化

	zhiling();				//学习指令

	while(1)				//大循环
	{
		LED_flash();       	//灯闪烁
	}
}  

void zhiling()
{
	/********************************************************
	*例1	将累加器B中的9Ah存放到地址为1500h的存储单元		*
	*		STM #1500h, AR1	;AR1=1500h						*
	*		LD #9Ah, B		;B=9Ah，注意这里只能是短立即数	*
	*		DST B, *AR1+	;AR1里必须是偶地址				*
	*		这里B是40位，只存储32位，存储单元是16位，		*
	*		所以需2个存储单元，地址自增的时候，加2			*
	*		AR1的变化：1500h-->1502h						*
	********************************************************/
	asm	("	STM #1500h, AR1	");//立即数1500h加载到AR1
	asm	("	LD #9Ah, B	");//立即数9Ah加载到B
	asm	("	DST B, *AR1+	");//(1500h)=0000h,(1500h)=009Ah

	/********************************************************
	*例2  	加载和存储T暂存器的内容							*
	*		STM #4231h, T	;T=4231h						*
	*		ST T, *AR1+		;T-->(AR1)=4231h				*
	*		ST #6666h, *AR1-	;6666h-->(AR1)=6666h		*
	*		因为在例1中AR1已经加2，即为1502h				*
	*		所以在地址1502存储单元中存入T暂存器的值			*
	*		然后再自增，这里只加1，因为T是16位的			*
	*		最后一句是验证6666h是否存在下1个地址单元中		*
	*		AR1的变化：1502h-->1503h-->1502h				*
	********************************************************/
	asm	("	STM #4231h, T	");//立即数4231h加载到T
	asm	("	ST T, *AR1+	");//T中的内容存到AR1中地址所指的空间
	asm	("	ST #6666h, *AR1-	");//长立即数存到下1个存储单元

	/********************************************************
	*例3  	给累加器A一个双16位长字							*
	*		DLD *AR1+, A;(1502h)->A(31~16),(1503h)->A(15~0)	*
	*		DST A, *AR1+;A(31~16)->(1504h),A(15~0)->(1505h)	*
	*		ST #8888h, *AR1		;8888h-->(1506h)			*
	*		AR1的变化：1502h-->1504h-->1506h				*
	********************************************************/
	asm	("	DLD *AR1+, A	");//加载累加器A的低32位
	asm	("	DST A, *AR1+	");//将累加器A存储到1504h地址
	asm	("	ST #8888h, *AR1	");//长立即数存到下2个存储单元
}




